app/controllers/statuses_controller.rb

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Another test"], ["created_at", "2014-08-11 15:18:10.560720"], ["updated_at", "2014-08-11 15:18:10.560720"], ["user_id", 5]]

  def update
    respond_to do |format|
      if @status.update(status_params)
---
UPDATE "statuses" SET "content" = ?, "updated_at" = ? WHERE "statuses"."id" = 3  [["content", "ghjgjhg"], ["updated_at", "2014-07-30 20:36:20.676731"]]

  def destroy
    @status.destroy
---
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]